ГТС/УТГТС/InformationRegisters/КомандыДокументовEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КомандыДокументовEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяКоманда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СценарийВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СценарииВыполненияКомандEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентскиеОбработчики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомандыПроцессаЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыДокументовEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовEDI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПоставщику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СценарииВыполненияКомандEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СценарииВыполненияКомандEDI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоздатьДокументВСервисе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьСтатусДокументаВСервисе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьНаСогласованиеВерсиюОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьВерсиюКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкачатьВерсиюИзСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьВерсиюВСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКСравнениюВерсий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/КомандыПроцессаЗаказаEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КомандыПроцессаЗаказаEDI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СравнитьВерсииЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СравнитьВерсииЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьЗаказПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьЗаказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьВерсиюПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьВерсиюПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправитьНаСогласованиеВерсиюПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправитьНаСогласованиеВерсиюПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьОтменуЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьОтменуЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьОтменуЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьОтменуЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьЗапросНаИзменениеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьЗапросНаИзменениеЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьЗапросНаИзменениеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьЗапросНаИзменениеЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонитьЗапросНаВыполнениеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьВыполнениеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтметитьВыполнениеЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьОтметкуВыполненияЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправитьЗапросНаИзменениеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправитьЗапросНаИзменениеЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьЗапросНаИзменениеЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьЗапросНаИзменениеЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаказПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкачатьВерсиюИзСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьВерсиюВСервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьНезначительныеИзмененияВерсииПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьНезначительныеИзмененияВерсииПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКСравнениюВерсийЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКСравнениюВерсийЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКПросмотруВерсииЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКПросмотруВерсииЗаказаПоставщику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/КомандыДокументовEDI/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НаборКомандПоУмолчанию(ТипДокумента) Экспорт
	
	НаборКоманд = Новый Соответствие;
	Если ТипДокумента = Перечисления.ТипыДокументовEDI.ЗаказПоставщику Тогда
		ДанныеКоманды = Новый Структура;
		ДанныеКоманды.Вставить("Представление"         , НСтр("ru = 'Отправить заказ'"));
		ДанныеКоманды.Вставить("Пояснение"             , "");
		ДанныеКоманды.Вставить("Картинка"              , Новый Картинка);
		ДанныеКоманды.Вставить("ОсновнаяКоманда"       , Истина);
		ДанныеКоманды.Вставить("Порядок"               , 1);
		ДанныеКоманды.Вставить("СценарийВыполнения"    , Перечисления.СценарииВыполненияКомандEDI.СоздатьДокументВСервисе);
		ДанныеКоманды.Вставить("КлиентскиеОбработчики" , Новый Массив);
		
		НаборКоманд.Вставить(Перечисления.КомандыПроцессаЗаказаEDI.СоздатьЗаказПоставщику,
			ДанныеКоманды);
	КонецЕсли;
	
	Возврат НаборКоманд;
	
КонецФункции

Функция ПрочитатьКомандыДокумента(ИдентификаторДокумента, ТипДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомандыДокументовEDI.Команда КАК Команда,
	|	КомандыДокументовEDI.Представление КАК Представление,
	|	КомандыДокументовEDI.Пояснение КАК Пояснение,
	|	КомандыДокументовEDI.ИдентификаторКартинки КАК ИдентификаторКартинки,
	|	КомандыДокументовEDI.ОсновнаяКоманда КАК ОсновнаяКоманда,
	|	КомандыДокументовEDI.Порядок КАК Порядок,
	|	КомандыДокументовEDI.СценарийВыполнения КАК СценарийВыполнения,
	|	КомандыДокументовEDI.КлиентскиеОбработчики КАК КлиентскиеОбработчикиСтрока,
	|	КомандыДокументовEDI.URL КАК URL
	|ИЗ
	|	РегистрСведений.КомандыДокументовEDI КАК КомандыДокументовEDI
	|ГДЕ
	|	КомандыДокументовEDI.ИдентификаторДокумента = &ИдентификаторДокумента
	|	И КомандыДокументовEDI.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента" , ИдентификаторДокумента);
	Запрос.УстановитьПараметр("ТипДокумента"           , ТипДокумента);
	
	НаборКоманд = Новый Соответствие;
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		ДанныеКоманды = Новый Структура("Представление, Пояснение, ИдентификаторКартинки, Картинка, ОсновнаяКоманда, 
			|Порядок, СценарийВыполнения, КлиентскиеОбработчики, URL");
		
		ЗаполнитьЗначенияСвойств(ДанныеКоманды, ВыборкаЗапроса);
		
		Если Не ЗначениеЗаполнено(ДанныеКоманды.ИдентификаторКартинки) Тогда
			ДанныеКоманды.Картинка = Новый Картинка;
		ИначеЕсли Метаданные.ОбщиеКартинки.Найти(ДанныеКоманды.ИдентификаторКартинки) = Неопределено Тогда
			ДанныеКоманды.Картинка = Новый Картинка;
		Иначе
			ДанныеКоманды.Картинка = БиблиотекаКартинок[ДанныеКоманды.ИдентификаторКартинки];
		КонецЕсли;
		
		ДанныеКоманды.КлиентскиеОбработчики = СтрРазделить(ВыборкаЗапроса.КлиентскиеОбработчикиСтрока, ",");
		
		НаборКоманд.Вставить(ВыборкаЗапроса.Команда, ДанныеКоманды);
		
	КонецЦикла;
	
	Возврат НаборКоманд;
	
КонецФункции

Процедура УстановитьКомандыДокумента(ИдентификаторДокумента, ТипДокумента, НаборКоманд) Экспорт
	
	ЗаписатьКомандыДокумента(ИдентификаторДокумента, ТипДокумента, НаборКоманд);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьКомандыДокумента(ИдентификаторДокумента, ТипДокумента, НаборКоманд)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КомандыДокументовEDI");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировкиДанных.УстановитьЗначение("ИдентификаторДокумента" , ИдентификаторДокумента);
		ЭлементБлокировкиДанных.УстановитьЗначение("ТипДокумента"           , ТипДокумента);
		
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.КомандыДокументовEDI.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторДокумента.Установить(ИдентификаторДокумента);
		НаборЗаписей.Отбор.ТипДокумента.Установить(ТипДокумента);
		
		НомерКоманды = 0;
		
		Для каждого КомандаНабора Из НаборКоманд Цикл
			
			НомерКоманды = НомерКоманды + 1;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ИдентификаторДокумента = ИдентификаторДокумента;
			НоваяЗапись.ТипДокумента           = ТипДокумента;
			НоваяЗапись.Команда                = КомандаНабора.Ключ;
			НоваяЗапись.URL                    = КомандаНабора.Значение.URL;
			
			Если ЗначениеЗаполнено(КомандаНабора.Значение.КлиентскиеОбработчики) Тогда
				НоваяЗапись.КлиентскиеОбработчики  = СтрСоединить(КомандаНабора.Значение.КлиентскиеОбработчики, ",");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, КомандаНабора.Значение, , "КлиентскиеОбработчики");
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось записать команды документа по причине: %1.'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение(ТекстИсключения);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
